In [32]:
import pandas as pd
import numpy as np

In [31]:
data = [['Juan',25],['Maria',30], ['Pedro',40]]
print(type(data))

<class 'list'>

In [4]:
df = pd.DataFrame(data, columns=['Nombre','Edad'])

In [5]:
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [6]:
data = {'Nombre': ['Juan','Maria', 'Pedro'], 'Edad': [25,30,40]}
print(type(data))

<class 'dict'>

In [7]:
df = pd.DataFrame(data)

In [8]:
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [10]:
data = [('Juan',25),('Maria',30), ('Pedro',40)]
print(type(data))

<class 'list'>

In [11]:
df = pd.DataFrame(data, columns=['Nombre','Edad'])

In [12]:
df

  Nombre  Edad
0   Juan    25
1  Maria    30
2  Pedro    40

In [16]:
df = pd.read_csv('../data/data',sep='|')

In [18]:
df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [19]:
df = pd.read_csv('../data/data.csv')

In [20]:
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [22]:
df = pd.read_csv('../data/data_without_header')

In [23]:
df

    Juan  25     Madrid
0  María  30  Barcelona
1  Pedro  35    Sevilla

In [4]:
df = pd.read_csv('../data/data_without_header', header = None)
df

       0   1          2
0   Juan  25     Madrid
1  María  30  Barcelona
2  Pedro  35    Sevilla

In [5]:
df = pd.read_csv('../data/data_without_header', header = None,names=['nombre','edad','ciudad'])
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [6]:
df = pd.read_json('../data/data.json')
df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [7]:
df = pd.read_json('../data/data.json')
df.columns

Index(['nombre', 'edad', 'ciudad'], dtype='object')

In [9]:
df.head(2)

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona

In [11]:
df.tail(1)

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [12]:
df.describe()

       edad
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [14]:
df.shape

(3, 3)

In [15]:
df['nombre']

0     Juan
1    María
2    Pedro
Name: nombre, dtype: object

In [17]:
df[['nombre','edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [18]:
df.loc[0]

nombre      Juan
edad          25
ciudad    Madrid
Name: 0, dtype: object

In [20]:
df.loc[[0,2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [21]:
df[df['edad'] > 25]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [22]:
df[df['edad'] > 30]

  nombre  edad   ciudad
2  Pedro    35  Sevilla

In [23]:
data = {
    'grupo': ['A', 'B', 'A', 'B', 'A', 'B'],
    'valor': [10, 15, 25,12,27,33]
}
df = pd.DataFrame(data)
df

  grupo  valor
0     A     10
1     B     15
2     A     25
3     B     12
4     A     27
5     B     33

In [24]:
df.groupby('grupo').mean()

           valor
grupo
A      20.666667
B      20.000000

In [26]:
df.groupby('grupo').sum()

       valor
grupo
A         62
B         60

In [34]:
data = {
    'A': [1,2,np.nan,4],
    'B': [4,np.nan,5,7]
}

df = pd.DataFrame(data)
df

     A    B
0  1.0  4.0
1  2.0  NaN
2  NaN  5.0
3  4.0  7.0

In [35]:
df_lleno = df.fillna(value=0)
df_lleno

     A    B
0  1.0  4.0
1  2.0  0.0
2  0.0  5.0
3  4.0  7.0

In [36]:
df_sin_na = df.dropna()
df_sin_na

     A    B
0  1.0  4.0
3  4.0  7.0

In [37]:
def suma(a,b):
    return a+b

In [38]:
df['suma'] = df['A'] + df['B']
df

     A    B  suma
0  1.0  4.0   5.0
1  2.0  NaN   NaN
2  NaN  5.0   NaN
3  4.0  7.0  11.0

In [39]:
df['dobleA'] = df['A'].apply(lambda x: x*2)
df

     A    B  suma  dobleA
0  1.0  4.0   5.0     2.0
1  2.0  NaN   NaN     4.0
2  NaN  5.0   NaN     NaN
3  4.0  7.0  11.0     8.0

In [42]:

def suma(a, b):

    return a + b

df['suma2'] = df.apply(lambda row: suma(row['A'], row['B']), axis=1)